In [1]:
import pandas as pd

In [2]:
f1 = pd.read_excel(r"C:\Users\priya\OneDrive\Desktop\Intern\test_task1.2.xlsx", sheet_name='Sheet1')
f2 = pd.read_excel(r"C:\Users\priya\OneDrive\Desktop\Intern\test_task1.2.xlsx", sheet_name='Sheet2')

In [3]:
f1.keys()

Index(['IMC', 'Name'], dtype='object')

In [4]:
f2.keys()

Index(['IMC', 'Specialty', 'County1'], dtype='object')

In [5]:
f3 = f1[["IMC", 
         "Name"]].merge(f2[["IMC", "Specialty","County1"]], 
                                     on = "IMC", 
                                     how = "left")

In [6]:
f3.to_excel("Results.xlsx", index = False)

In [7]:
f3

,IMC,Name,Specialty,County1
0,406467,Sinead Howley,Specialist Registration,Dublin 4
1,414652,Caroline Jennings,Trainee Specialist Registration,Dublin 9
2,371484,Micheal O'Maoil-Eoin,Trainee Specialist Registration,Louth
3,400731,Nicola Sweeney,Trainee Specialist Registration,Dublin 2
4,418651,Avril Coughlan,General Registration,Mayo
...,...,...,...,...
96,164,Mary Kennedy,General Registration,Clare
97,50577,Abbas Bakhtiari,General Registration,Dublin 7
98,405708,Abdelaziz Rosell Fernandez,General Registration,Carlow
99,23050,Abdul Abdul Aziz,General Registration,Dublin
100,13728,Abdul Bhutta,General Registration,Dublin 14